RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma2d.c
/**
  ******************************************************************************
  * @file    bl808_dma2d.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808.h"
#include "bl808_dma2d.h"
#include "bl808_glb.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DMA2D
 *  @{
 */

/** @defgroup  DMA2D_Private_Macros
 *  @{
 */
#define DMA2D_Get_Channel(id_base, ch) ((id_base) + (ch)*0x100)

/*@} end of group DMA2D_Private_Macros */

/** @defgroup  DMA2D_Private_Types
 *  @{
 */

/*@} end of group DMA2D_Private_Types */

/** @defgroup  DMA2D_Private_Variables
 *  @{
 */
static const uint32_t dma2dAddr[DMA2D_ID_MAX] = { DMA2D_BASE };
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *dma2dIntCbfArra[DMA2D_ID_MAX][DMA2D_CH_MAX][DMA2D_INT_ALL] = {
    { { NULL } }
};
#endif
static DMA2D_LLI_Ctrl_Type PingPongListArra[DMA2D_ID_MAX][DMA2D_CH_MAX][2];

/*@} end of group DMA2D_Private_Variables */

/** @defgroup  DMA2D_Global_Variables
 *  @{
 */

/*@} end of group DMA2D_Global_Variables */

/** @defgroup  DMA2D_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static void DMA2D_IntHandler(DMA2D_ID_Type dmaId);
#endif
static void CPU_Interrupt_Enable_DMA2D(DMA2D_ID_Type dmaId);
static void CPU_Interrupt_Disable_DMA2D(DMA2D_ID_Type dmaId);

/*@} end of group DMA2D_Private_Fun_Declaration */

/** @defgroup  DMA2D_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DMA2D interrupt handler
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void DMA2D_IntHandler(DMA2D_ID_Type dmaId)
{
    uint32_t tmpVal;
    uint8_t ch;
    /* Get DMA2D register */
    uint32_t DMA2DChs = dma2dAddr[dmaId];

    for (ch = 0; ch < DMA2D_CH_MAX; ch++) {
        tmpVal = BL_RD_REG(DMA2DChs, DMA2D_DMA_INTSTATUS);

        if ((BL_GET_REG_BITS_VAL(tmpVal, DMA2D_INTSTATUS) & (1 << ch)) != 0) {
            /* Clear interrupt */
            BL_WR_REG(DMA2DChs, DMA2D_DMA_INTTCCLEAR, 1 << ch);

            if (dma2dIntCbfArra[dmaId][ch][DMA2D_INT_TCOMPLETED] != NULL) {
                /* Call the callback function */
                dma2dIntCbfArra[dmaId][ch][DMA2D_INT_TCOMPLETED]();
            }
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  CPU enable DMA2D interrupt
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return None
 *
*******************************************************************************/
static void CPU_Interrupt_Enable_DMA2D(DMA2D_ID_Type dmaId)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));

    CPU_Interrupt_Enable(DMA2D_INT0_IRQn);
    CPU_Interrupt_Enable(DMA2D_INT1_IRQn);
}

/****************************************************************************/ /**
 * @brief  CPU disable DMA2D interrupt
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return None
 *
*******************************************************************************/
static void CPU_Interrupt_Disable_DMA2D(DMA2D_ID_Type dmaId)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));

    CPU_Interrupt_Disable(DMA2D_INT0_IRQn);
    CPU_Interrupt_Disable(DMA2D_INT1_IRQn);
}

/*@} end of group DMA2D_Private_Functions */

/** @defgroup  DMA2D_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DMA2D enable
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Enable(DMA2D_ID_Type dmaId)
{
    uint32_t tmpVal;
    /* Get DMA2D register */
    uint32_t DMA2DChs = dma2dAddr[dmaId];

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_DMA_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DMA2D_E);
    BL_WR_REG(DMA2DChs, DMA2D_DMA_CONFIG, tmpVal);
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(DMA2D_INT0_IRQn, DMA2D_INT0_IRQHandler);
    Interrupt_Handler_Register(DMA2D_INT1_IRQn, DMA2D_INT1_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  DMA2D disable
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Disable(DMA2D_ID_Type dmaId)
{
    uint32_t tmpVal;
    /* Get DMA2D register */
    uint32_t DMA2DChs = dma2dAddr[dmaId];

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));

