RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma2d.c
    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_DMA_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DMA2D_E);
    BL_WR_REG(DMA2DChs, DMA2D_DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D configure function
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
void DMA2D_Init(DMA2D_ID_Type dmaId, uint8_t ch, DMA2D_Cfg_Type *cfg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_CFG);
    BL_WR_REG(DMA2DChs, DMA2D_C0_CFG, BL_SET_REG_BIT(tmpVal, DMA2D_REG_DMA_2D_EN));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_SRC_CNT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRC_X_CNT, cfg->srcCntX);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRC_Y_CNT, cfg->srcCntY);
    BL_WR_REG(DMA2DChs, DMA2D_C0_SRC_CNT, tmpVal);

    BL_WR_REG(DMA2DChs, DMA2D_C0_SRC_XIC, cfg->srcIncrX);
    BL_WR_REG(DMA2DChs, DMA2D_C0_SRC_YIC, cfg->srcIncrY);

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_DST_CNT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DST_X_CNT, cfg->dstCntX);
    BL_WR_REG(DMA2DChs, DMA2D_C0_DST_CNT, tmpVal);

    BL_WR_REG(DMA2DChs, DMA2D_C0_DST_XIC, cfg->dstIncrX);
    BL_WR_REG(DMA2DChs, DMA2D_C0_DST_YIC, cfg->dstIncrY);
}

/****************************************************************************/ /**
 * @brief  DMA2D channel init
 *
 * @param  dmaId: DMA2D ID type
 * @param  chCfg: DMA2D configuration
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Channel_Init(DMA2D_ID_Type dmaId, DMA2D_Channel_Cfg_Type *chCfg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], chCfg->ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(chCfg->ch));
    CHECK_PARAM(IS_DMA2D_TRANS_WIDTH_TYPE(chCfg->srcTransfWidth));
    CHECK_PARAM(IS_DMA2D_TRANS_WIDTH_TYPE(chCfg->dstTransfWidth));
    CHECK_PARAM(IS_DMA2D_BURST_SIZE_TYPE(chCfg->srcBurstSize));
    CHECK_PARAM(IS_DMA2D_BURST_SIZE_TYPE(chCfg->dstBurstSize));
    CHECK_PARAM(IS_DMA2D_TRANS_DIR_TYPE(chCfg->dir));
    CHECK_PARAM(IS_DMA2D_PERIPH_REQ_TYPE(chCfg->dstPeriph));
    CHECK_PARAM(IS_DMA2D_PERIPH_REQ_TYPE(chCfg->srcPeriph));

    /* Config channel config */
    BL_WR_REG(DMA2DChs, DMA2D_C0SRCADDR, chCfg->srcDmaAddr);
    BL_WR_REG(DMA2DChs, DMA2D_C0DSTADDR, chCfg->destDmaAddr);

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_BUS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_TRANSFERSIZE, chCfg->transfLength);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRC_SIZE, chCfg->srcTransfWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DST_SIZE, chCfg->dstTransfWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRC_BURST, chCfg->srcBurstSize);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DST_BURST, chCfg->dstBurstSize);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SI, chCfg->srcAddrInc);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DI, chCfg->destAddrInc);
    BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_CFG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_FLOWCNTRL, chCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DSTPERIPHERAL, chCfg->dstPeriph);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRCPERIPHERAL, chCfg->srcPeriph);
    BL_WR_REG(DMA2DChs, DMA2D_C0_CFG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D set default value of all registers function
 *
 * @param  dmaId: DMA2D ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
void DMA2D_DeInit(DMA2D_ID_Type dmaId)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));

    GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DMA2D);
}

/****************************************************************************/ /**
 * @brief  DMA2D channel update source memory address and len
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel
 * @param  memAddr: source memoty address
 * @param  len: source memory data length
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Channel_Update_SrcMemcfg(DMA2D_ID_Type dmaId, uint8_t ch, uint32_t memAddr, uint32_t len)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    /* config channel config*/
    BL_WR_REG(DMA2DChs, DMA2D_C0SRCADDR, memAddr);
    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_BUS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_TRANSFERSIZE, len);
    BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D channel update destination memory address and len
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel
 * @param  memAddr: destination memoty address
 * @param  len: destination memory data length
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Channel_Update_DstMemcfg(DMA2D_ID_Type dmaId, uint8_t ch, uint32_t memAddr, uint32_t len)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    /* config channel config*/
    BL_WR_REG(DMA2DChs, DMA2D_C0DSTADDR, memAddr);
    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_BUS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_TRANSFERSIZE, len);
    BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get DMA2D channel tranfersize
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel
 *
 * @return tranfersize size
 *
*******************************************************************************/
uint32_t DMA2D_Channel_TranferSize(DMA2D_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(DMA2DChs, DMA2D_C0_BUS), DMA2D_TRANSFERSIZE);
}

/****************************************************************************/ /**
 * @brief  Get DMA2D channel busy status
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type DMA2D_Channel_Is_Busy(DMA2D_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    return BL_IS_REG_BIT_SET(BL_RD_REG(DMA2DChs, DMA2D_C0_CFG), DMA2D_CH_EN) == 1 ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  DMA2D enable
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Channel_Enable(DMA2D_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_CFG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DMA2D_CH_EN);
    BL_WR_REG(DMA2DChs, DMA2D_C0_CFG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D disable
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Channel_Disable(DMA2D_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_CFG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DMA2D_CH_EN);
    BL_WR_REG(DMA2DChs, DMA2D_C0_CFG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D init LLI transfer
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 * @param  lliCfg: LLI configuration
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_Init(DMA2D_ID_Type dmaId, uint8_t ch, DMA2D_LLI_Cfg_Type *lliCfg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));
    CHECK_PARAM(IS_DMA2D_TRANS_DIR_TYPE(lliCfg->dir));
    CHECK_PARAM(IS_DMA2D_PERIPH_REQ_TYPE(lliCfg->dstPeriph));
    CHECK_PARAM(IS_DMA2D_PERIPH_REQ_TYPE(lliCfg->srcPeriph));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_CFG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_FLOWCNTRL, lliCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_DSTPERIPHERAL, lliCfg->dstPeriph);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_SRCPERIPHERAL, lliCfg->srcPeriph);
    BL_WR_REG(DMA2DChs, DMA2D_C0_CFG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D channel update LLI
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 * @param  LLI: LLI addr
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_Update(DMA2D_ID_Type dmaId, uint8_t ch, uint32_t LLI)
{
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch) + 0x100;

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

