RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma2d.c
    /* Config channel config */
    //BL_WR_REG(DMA2DChs, DMA2D_LLI, LLI);
    ARCH_MemCpy4((uint32_t *)(uintptr_t)DMA2DChs, (uint32_t *)(uintptr_t)LLI, 10);
}

/****************************************************************************/ /**
 * @brief  DMA2D channel get LLI counter
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 *
 * @return LLI counter
 *
*******************************************************************************/
uint32_t DMA2D_LLI_Get_Counter(DMA2D_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(DMA2DChs, DMA2D_C0_CFG), DMA2D_LLICOUNTER);
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI PingPong Structure Start
 *
 * @param  dmaPpStruct: dma pp struct pointer
 * @param  Ping_Transfer_len: ping len
 * @param  Pong_Transfer_len: pong len
 *
 * @return Succrss or not
 *
*******************************************************************************/
BL_Err_Type DMA2D_LLI_PpStruct_Set_Transfer_Len(DMA2D_LLI_PP_Struct *dmaPpStruct, uint16_t Ping_Transfer_len, uint16_t Pong_Transfer_len)
{
    struct DMA2D_Control_Reg dmaCtrlRegVal_temp;

    if (Ping_Transfer_len > 4096 || Pong_Transfer_len > 4096) {
        return ERROR;
    }

    dmaCtrlRegVal_temp = PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].dmaCtrl;
    dmaCtrlRegVal_temp.TransferSize = Ping_Transfer_len;
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

    dmaCtrlRegVal_temp = PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].dmaCtrl;
    dmaCtrlRegVal_temp.TransferSize = Pong_Transfer_len;
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

    DMA2D_LLI_Init(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, dmaPpStruct->lliCfg);
    DMA2D_LLI_Update(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX]);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI Start New Transmit for Ping-Pong Buf
 *
 * @param  dmaPpBuf: DMA2D LLI Ping-Pong Buf
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_PpBuf_Start_New_Transmit(DMA2D_LLI_PP_Buf *dmaPpBuf)
{
    CPU_Interrupt_Disable_DMA2D(dmaPpBuf->dmaId);

    if (dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] != NULL) {
        DMA2D_LLI_Update(dmaPpBuf->dmaId, dmaPpBuf->dmaChan, (uint32_t)(uintptr_t)dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex]);
        DMA2D_Channel_Enable(dmaPpBuf->dmaId, dmaPpBuf->dmaChan);
        dmaPpBuf->idleIndex = (dmaPpBuf->idleIndex == 0) ? 1 : 0;
    }

    CPU_Interrupt_Enable_DMA2D(dmaPpBuf->dmaId);
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI Remove Completed Ping-Pong Buf List
 *
 * @param  dmaPpBuf: DMA2D LLI Ping-Pong Buf
 *
 * @return Next Ping-Pong Buf List Header
 *
*******************************************************************************/
DMA2D_LLI_Ctrl_Type *DMA2D_LLI_PpBuf_Remove_Completed_List(DMA2D_LLI_PP_Buf *dmaPpBuf)
{
    CPU_Interrupt_Disable_DMA2D(dmaPpBuf->dmaId);

    dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] = NULL;
    CPU_Interrupt_Enable_DMA2D(dmaPpBuf->dmaId);
    return dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex];
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI Append Buf to List
 *
 * @param  dmaPpBuf: DMA2D LLI Ping-Pong Buf
 * @param  dmaLliList: New LLI Buf to Append
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_PpBuf_Append(DMA2D_LLI_PP_Buf *dmaPpBuf, DMA2D_LLI_Ctrl_Type *dmaLliList)
{
    DMA2D_LLI_Ctrl_Type *pLliList = NULL;
    CPU_Interrupt_Disable_DMA2D(dmaPpBuf->dmaId);

    pLliList = dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex];

    if (pLliList == NULL) {
        dmaLliList->nextLLI = 0;
        dmaLliList->dmaCtrl.I = 1;
        dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] = dmaLliList;
    } else {
        /*Append to last */
        while (pLliList->nextLLI != 0) {
            pLliList = (DMA2D_LLI_Ctrl_Type *)(uintptr_t)pLliList->nextLLI;
        }

        pLliList->nextLLI = (uint32_t)(uintptr_t)dmaLliList;
        pLliList->dmaCtrl.I = 0;
        dmaLliList->nextLLI = 0;
        dmaLliList->dmaCtrl.I = 1;
    }

    if (DMA2D_Channel_Is_Busy(dmaPpBuf->dmaId, dmaPpBuf->dmaChan) == RESET) {
        /* DMA2D stopped: maybe stop just a few minutes ago(not enter INT due to CPU_Interrupt_Disable)
           or has already stopped before this function is called */
        if (dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] == NULL) {
            /* DMA2D has already stopped before this function is called */
            DMA2D_LLI_PpBuf_Start_New_Transmit(dmaPpBuf);
        }
    }

    CPU_Interrupt_Enable_DMA2D(dmaPpBuf->dmaId);
}

/****************************************************************************/ /**
 * @brief  DMA2D LLi Destroy Ping-Pong Buf
 *
 * @param  dmaPpBuf: DMA2D LLI Ping-Pong Buf
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_PpBuf_Destroy(DMA2D_LLI_PP_Buf *dmaPpBuf)
{
    /* DMA2D LLI Disable */
    DMA2D_Channel_Disable(dmaPpBuf->dmaId, dmaPpBuf->dmaChan);

    if (dmaPpBuf->lliListHeader[0] != NULL && dmaPpBuf->onTransCompleted != NULL) {
        dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[0]);
    }

    dmaPpBuf->lliListHeader[0] = NULL;

    if (dmaPpBuf->lliListHeader[1] != NULL && dmaPpBuf->onTransCompleted != NULL) {
        dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[1]);
    }

    dmaPpBuf->lliListHeader[1] = NULL;
    dmaPpBuf->idleIndex = 0;
}

/****************************************************************************/ /**
 * @brief  Mask/Unmask the DMA2D interrupt
 *
 * @param  dmaId: DMA2D ID type
 * @param  ch: DMA2D channel number
 * @param  intType: Specifies the interrupt type
 * @param  intMask: Enable/Disable Specified interrupt type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_IntMask(DMA2D_ID_Type dmaId, uint8_t ch, DMA2D_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(ch));
    CHECK_PARAM(IS_DMA2D_INT_TYPE(intType));

    switch (intType) {
        case DMA2D_INT_TCOMPLETED:
            if (intMask == UNMASK) {
                /* UNMASK(Enable) this interrupt */
                tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMA2DChs, DMA2D_C0_BUS), DMA2D_I);
                BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
            } else {
                /* MASK(Disable) this interrupt */
                tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMA2DChs, DMA2D_C0_BUS), DMA2D_I);
                BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
            }

            break;

        case DMA2D_INT_ALL:
            if (intMask == UNMASK) {
                /* UNMASK(Enable) this interrupt */
                tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_BUS);
                tmpVal = BL_SET_REG_BIT(tmpVal, DMA2D_I);
                BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
            } else {
                /* MASK(Disable) this interrupt */
                tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_BUS);
                tmpVal = BL_CLR_REG_BIT(tmpVal, DMA2D_I);
                BL_WR_REG(DMA2DChs, DMA2D_C0_BUS, tmpVal);
            }

            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  Install DMA2D interrupt callback function
 *
 * @param  dmaId: DMA2D ID type
 * @param  dmaChan: DMA2D Channel type
 * @param  intType: DMA2D interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2D_Int_Callback_Install(DMA2D_ID_Type dmaId, DMA2D_Chan_Type dmaChan, DMA2D_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA2D_CHAN_TYPE(dmaChan));
    CHECK_PARAM(IS_DMA2D_INT_TYPE(intType));

    dma2dIntCbfArra[dmaId][dmaChan][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA2D channel 0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2D_INT0_IRQHandler(void)
{
    DMA2D_IntHandler(DMA2D0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA2D channel 1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2D_INT1_IRQHandler(void)
{
    DMA2D_IntHandler(DMA2D0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  DMA2D LLI PingPong Structure Initial
 *
 * @param  dmaPpStruct: DMA2D LLI PingPong Config Parameter
 *
 * @return start success or not
 *
*******************************************************************************/
BL_Err_Type DMA2D_LLI_PpStruct_Init(DMA2D_LLI_PP_Struct *dmaPpStruct)
{
    //setup lliList
    dmaPpStruct->dmaCtrlRegVal.I = 1;
    dmaPpStruct->pingpongIndex = 0;

    if (dmaPpStruct->lliCfg->dir == DMA2D_TRNS_M2P) {
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].srcDmaAddr = dmaPpStruct->pingpongBufAddr[0];
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;

        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].srcDmaAddr = dmaPpStruct->pingpongBufAddr[1];
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;
    } else if (dmaPpStruct->lliCfg->dir == DMA2D_TRNS_P2M) {
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].srcDmaAddr = dmaPpStruct->operatePeriphAddr;
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].destDmaAddr = dmaPpStruct->pingpongBufAddr[0];

        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].srcDmaAddr = dmaPpStruct->operatePeriphAddr;
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].destDmaAddr = dmaPpStruct->pingpongBufAddr[1];
    } else {
        return ERROR;
        /*V1.0 version DMA2D LLI Ping-Pong structure not support P2P & M2M MODE*/
    }

    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].nextLLI = (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX];
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].nextLLI = (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX];
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PONG_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

    DMA2D_LLI_Init(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, dmaPpStruct->lliCfg);

    DMA2D_LLI_Update(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][DMA2D_PING_INDEX]);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI PingPong Structure Start
 *
 * @param  dmaPpStruct: None
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_PpStruct_Start(DMA2D_LLI_PP_Struct *dmaPpStruct)
{
    DMA2D_Channel_Enable(dmaPpStruct->dmaId, dmaPpStruct->dmaChan);
}

/****************************************************************************/ /**
 * @brief  DMA2D LLI PingPong Structure Stop
 *
 * @param  dmaPpStruct: None
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_LLI_PpStruct_Stop(DMA2D_LLI_PP_Struct *dmaPpStruct)
{
    DMA2D_Channel_Disable(dmaPpStruct->dmaId, dmaPpStruct->dmaChan);
}

/****************************************************************************/ /**
 * @brief  DMA2D translate picture
 *
 * @param  cfg: Pointer of DMA2D picture configure type
 * @param  lliCfg: Pointer of DMA2D LLI ctrl type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Picture_Translate_Calculate(DMA2D_Picture_Cfg_Type *cfg, DMA2D_LLI_Ctrl_Type *lliCfg)
{
    uint32_t tmpVal = 1 << cfg->transWidth;
    lliCfg->dmaCtrl.SRC_SIZE = cfg->transWidth;
    lliCfg->dmaCtrl.DST_SIZE = cfg->transWidth;

    DMA2D_Picture_Cfg_Type pictureCfg = {
        .transWidth = cfg->transWidth,
        .pixWidth = cfg->pixWidth,
        .srcAddr = cfg->srcAddr,
        .srcWidth = cfg->srcWidth,
        .srcX0 = cfg->srcX0,
        .srcY0 = cfg->srcY0,
        .srcX1 = cfg->srcX1,
        .srcY1 = cfg->srcY1,
        .dstAddr = cfg->dstAddr,
        .dstWidth = cfg->dstWidth,
        .dstX0 = cfg->dstX0,
        .dstY0 = cfg->dstY0,
    };

    if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 <= cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    } else if (cfg->srcX0 <= cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth;
    } else if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    }

    lliCfg->srcDmaAddr = pictureCfg.srcAddr + pictureCfg.srcWidth * pictureCfg.pixWidth * pictureCfg.srcY0 + pictureCfg.pixWidth * pictureCfg.srcX0;
    lliCfg->destDmaAddr = pictureCfg.dstAddr + pictureCfg.dstWidth * pictureCfg.pixWidth * pictureCfg.dstY0 + pictureCfg.pixWidth * pictureCfg.dstX0;

    lliCfg->dma2dCfg.srcCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.srcIncrX = tmpVal;
    lliCfg->dma2dCfg.srcCntY = pictureCfg.srcY1 - pictureCfg.srcY0;
    lliCfg->dma2dCfg.srcIncrY = (pictureCfg.srcWidth - pictureCfg.srcX1 + pictureCfg.srcX0) * pictureCfg.pixWidth + tmpVal;
    lliCfg->dma2dCfg.dstCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.dstIncrX = tmpVal;
    lliCfg->dma2dCfg.dstIncrY = (pictureCfg.dstWidth - pictureCfg.srcX1 + pictureCfg.srcX0) * pictureCfg.pixWidth + tmpVal;
}

/****************************************************************************/ /**
 * @brief  DMA2D rotate picture
 *
 * @param  cfg: Pointer of DMA2D picture configure type
 * @param  lliCfg: Pointer of DMA2D LLI ctrl type
 * @param  rotate: Rotate degree type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Picture_Rotate_Calculate(DMA2D_Picture_Cfg_Type *cfg, DMA2D_LLI_Ctrl_Type *lliCfg, DMA2D_Rotate_Type rotate)
{
    uint32_t tmpVal = 1 << cfg->transWidth;
    lliCfg->dmaCtrl.SRC_SIZE = cfg->transWidth;
    lliCfg->dmaCtrl.DST_SIZE = cfg->transWidth;

    DMA2D_Picture_Cfg_Type pictureCfg = {
        .transWidth = cfg->transWidth,
        .pixWidth = cfg->pixWidth,
        .srcAddr = cfg->srcAddr,
        .srcWidth = cfg->srcWidth,
        .srcX0 = cfg->srcX0,
        .srcY0 = cfg->srcY0,
        .srcX1 = cfg->srcX1,
        .srcY1 = cfg->srcY1,
        .dstAddr = cfg->dstAddr,
        .dstWidth = cfg->dstWidth,
        .dstX0 = cfg->dstX0,
        .dstY0 = cfg->dstY0,
    };

    if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 <= cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
    } else if (cfg->srcX0 <= cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
    } else if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
    }

    lliCfg->srcDmaAddr = pictureCfg.srcAddr + pictureCfg.srcWidth * pictureCfg.pixWidth * pictureCfg.srcY0 + pictureCfg.pixWidth * pictureCfg.srcX0;
    lliCfg->destDmaAddr = pictureCfg.dstAddr + pictureCfg.dstWidth * pictureCfg.pixWidth * pictureCfg.dstY0 + pictureCfg.pixWidth * pictureCfg.dstX0;

    lliCfg->dma2dCfg.srcCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.srcIncrX = tmpVal;
    lliCfg->dma2dCfg.srcCntY = pictureCfg.srcY1 - pictureCfg.srcY0;
    lliCfg->dma2dCfg.srcIncrY = (pictureCfg.srcWidth - pictureCfg.srcX1 + pictureCfg.srcX0) * pictureCfg.pixWidth + tmpVal;
    lliCfg->dma2dCfg.dstCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.dstIncrX = pictureCfg.dstWidth * pictureCfg.pixWidth;
    lliCfg->dma2dCfg.dstIncrY = -((pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal * pictureCfg.pixWidth * pictureCfg.dstWidth) + pictureCfg.pixWidth * pictureCfg.dstWidth - tmpVal;

    if (rotate == DMA2D_ROTATE_DEGREE_90) {
        lliCfg->destDmaAddr += (pictureCfg.srcY1 - pictureCfg.srcY0 - 1) * tmpVal;
    } else if (rotate == DMA2D_ROTATE_DEGREE_180) {
        lliCfg->destDmaAddr += (pictureCfg.srcY1 - pictureCfg.srcY0) * tmpVal * pictureCfg.dstWidth + (pictureCfg.srcX1 - pictureCfg.srcX0 - 1) * tmpVal;
        lliCfg->dma2dCfg.dstIncrX = -tmpVal;
        lliCfg->dma2dCfg.dstIncrY = -pictureCfg.dstWidth * pictureCfg.pixWidth + (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth - tmpVal;
    } else if (rotate == DMA2D_ROTATE_DEGREE_270) {
        lliCfg->destDmaAddr += (pictureCfg.srcX1 - pictureCfg.srcX0 - 1) * tmpVal * pictureCfg.dstWidth;
        lliCfg->dma2dCfg.dstIncrX = -pictureCfg.dstWidth * pictureCfg.pixWidth;
        lliCfg->dma2dCfg.dstIncrY = -lliCfg->dma2dCfg.dstIncrY;
    }
}

/****************************************************************************/ /**
 * @brief  DMA2D fold picture
 *
 * @param  cfg: Pointer of DMA2D picture configure type
 * @param  lliCfg: Pointer of DMA2D LLI ctrl type
 * @param  fold: Fold direction type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Picture_Fold_Calculate(DMA2D_Picture_Cfg_Type *cfg, DMA2D_LLI_Ctrl_Type *lliCfg, DMA2D_Fold_Type fold)
{
    uint32_t tmpVal = 1 << cfg->transWidth;
    lliCfg->dmaCtrl.SRC_SIZE = cfg->transWidth;
    lliCfg->dmaCtrl.DST_SIZE = cfg->transWidth;

    DMA2D_Picture_Cfg_Type pictureCfg = {
        .transWidth = cfg->transWidth,
        .pixWidth = cfg->pixWidth,
        .srcAddr = cfg->srcAddr,
        .srcWidth = cfg->srcWidth,
        .srcX0 = cfg->srcX0,
        .srcY0 = cfg->srcY0,
        .srcX1 = cfg->srcX1,
        .srcY1 = cfg->srcY1,
        .dstAddr = cfg->dstAddr,
        .dstWidth = cfg->dstWidth,
        .dstX0 = cfg->dstX0,
        .dstY0 = cfg->dstY0,
    };

    if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 <= cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    } else if (cfg->srcX0 <= cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth;
    } else if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    }

    lliCfg->srcDmaAddr = pictureCfg.srcAddr + pictureCfg.srcWidth * pictureCfg.pixWidth * pictureCfg.srcY0 + pictureCfg.pixWidth * pictureCfg.srcX0;
    lliCfg->destDmaAddr = pictureCfg.dstAddr + pictureCfg.dstWidth * pictureCfg.pixWidth * pictureCfg.dstY0 + pictureCfg.pixWidth * pictureCfg.dstX0 + (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth - tmpVal;

    lliCfg->dma2dCfg.srcCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.srcIncrX = tmpVal;
    lliCfg->dma2dCfg.srcCntY = pictureCfg.srcY1 - pictureCfg.srcY0;
    lliCfg->dma2dCfg.srcIncrY = (pictureCfg.srcWidth - pictureCfg.srcX1 + pictureCfg.srcX0) * pictureCfg.pixWidth + tmpVal;
    lliCfg->dma2dCfg.dstCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.dstIncrX = -tmpVal;
    lliCfg->dma2dCfg.dstIncrY = (pictureCfg.dstWidth + pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth - tmpVal;

    if (fold == DMA2D_FOLD_UP_DOWN) {
        lliCfg->destDmaAddr = pictureCfg.dstAddr + pictureCfg.dstWidth * pictureCfg.pixWidth * pictureCfg.dstY0 + pictureCfg.pixWidth * pictureCfg.dstX0 + (pictureCfg.srcY1 - pictureCfg.srcY0 - 1) * pictureCfg.pixWidth * pictureCfg.dstWidth;
        lliCfg->dma2dCfg.dstIncrX = tmpVal;
        lliCfg->dma2dCfg.dstIncrY = -lliCfg->dma2dCfg.dstIncrY;
    }
}

/****************************************************************************/ /**
 * @brief  DMA2D fill picture
 *
 * @param  cfg: Pointer of DMA2D picture configure type
 * @param  lliCfg: Pointer of DMA2D LLI ctrl type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Picture_Fill_Calculate(DMA2D_Picture_Cfg_Type *cfg, DMA2D_LLI_Ctrl_Type *lliCfg)
{
    uint32_t tmpVal = 1 << cfg->transWidth;
    lliCfg->dmaCtrl.SRC_SIZE = cfg->transWidth;
    lliCfg->dmaCtrl.DST_SIZE = cfg->transWidth;

    DMA2D_Picture_Cfg_Type pictureCfg = {
        .transWidth = cfg->transWidth,
        .pixWidth = cfg->pixWidth,
        .srcAddr = cfg->srcAddr,
        .srcWidth = cfg->srcWidth,
        .srcX0 = cfg->srcX0,
        .srcY0 = cfg->srcY0,
        .srcX1 = cfg->srcX1,
        .srcY1 = cfg->srcY1,
        .dstAddr = cfg->dstAddr,
        .dstWidth = cfg->dstWidth,
        .dstX0 = cfg->dstX0,
        .dstY0 = cfg->dstY0,
    };

