RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma2d.c
    if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 <= cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    } else if (cfg->srcX0 <= cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth;
    } else if (cfg->srcX0 > cfg->srcX1 && cfg->srcY0 > cfg->srcY1) {
        pictureCfg.srcX0 = cfg->srcX1;
        pictureCfg.srcX1 = cfg->srcX0;
        pictureCfg.srcY0 = cfg->srcY1;
        pictureCfg.srcY1 = cfg->srcY0;
        pictureCfg.dstAddr = pictureCfg.dstAddr - (pictureCfg.srcY1 - pictureCfg.srcY0) * pictureCfg.pixWidth * pictureCfg.srcWidth - (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth;
    }

    lliCfg->srcDmaAddr = pictureCfg.srcAddr;
    lliCfg->destDmaAddr = pictureCfg.dstAddr + pictureCfg.dstWidth * pictureCfg.pixWidth * pictureCfg.dstY0 + pictureCfg.pixWidth * pictureCfg.dstX0;

    lliCfg->dma2dCfg.srcCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.srcIncrX = 0;
    lliCfg->dma2dCfg.srcCntY = pictureCfg.srcY1 - pictureCfg.srcY0;
    lliCfg->dma2dCfg.srcIncrY = 0;
    lliCfg->dma2dCfg.dstCntX = (pictureCfg.srcX1 - pictureCfg.srcX0) * pictureCfg.pixWidth / tmpVal;
    lliCfg->dma2dCfg.dstIncrX = tmpVal;
    lliCfg->dma2dCfg.dstIncrY = (pictureCfg.dstWidth - pictureCfg.srcX1 + pictureCfg.srcX0) * pictureCfg.pixWidth + tmpVal;
}

/****************************************************************************/ /**
 * @brief  DMA2D transfer start
 *
 * @param  dmaId: DMA2D id
 * @param  ch: DMA2D channel
 * @param  lliCfg: Pointer of DMA2D LLI ctrl type
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Picture_Transfer_Start(DMA2D_ID_Type dmaId, uint8_t ch, DMA2D_LLI_Ctrl_Type *lliCfg)
{
    DMA2D_Channel_Cfg_Type chCfg = {
        .srcDmaAddr = lliCfg->srcDmaAddr,
        .destDmaAddr = lliCfg->destDmaAddr,
        .transfLength = 0,
        .dir = DMA2D_TRNS_M2M,
        .ch = ch,
        .srcTransfWidth = lliCfg->dmaCtrl.SRC_SIZE,
        .dstTransfWidth = lliCfg->dmaCtrl.DST_SIZE,
        .srcBurstSize = DMA2D_BURST_SIZE_16,
        .dstBurstSize = DMA2D_BURST_SIZE_16,
        .srcAddrInc = DMA2D_MINC_ENABLE,
        .destAddrInc = DMA2D_MINC_ENABLE,
        .srcPeriph = DMA2D_REQ_NONE,
        .dstPeriph = DMA2D_REQ_NONE,
    };

    DMA2D_Channel_Disable(dmaId, ch);
    DMA2D_Init(dmaId, ch, &lliCfg->dma2dCfg);
    DMA2D_Channel_Init(dmaId, &chCfg);
    DMA2D_Enable(dmaId);
    DMA2D_Channel_Enable(dmaId, ch);
}

/****************************************************************************/ /**
 * @brief  DMA2D color key mode configure
 *
 * @param  dmaId: DMA2D id
 * @param  ch: DMA2D channel
 * @param  keyType: Color key type
 * @param  keyValue: Color key value
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Color_Key_Set(DMA2D_ID_Type dmaId, uint8_t ch, DMA2D_Color_Key_Type keyType, uint32_t keyValue)
{
    uint32_t tmpVal;
    /* Get DMA2D register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_COLOR_KEY_TYPE(keyType));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_KEY_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_KEY_MODE, keyType);
    switch(keyType)
    {
        case DMA2D_COLOR_KEY_8BIT:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_KEY_STRB, 0x1);
            break;
        case DMA2D_COLOR_KEY_16BIT:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_KEY_STRB, 0x3);
            break;
        case DMA2D_COLOR_KEY_24BIT:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_KEY_STRB, 0x7);
            break;
        case DMA2D_COLOR_KEY_32BIT:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA2D_KEY_STRB, 0xf);
            break;
        default:
            break;
    }
    BL_WR_REG(DMA2DChs, DMA2D_C0_KEY_EN, tmpVal);

    BL_WR_REG(DMA2DChs, DMA2D_C0_KEY, keyValue);
}

/****************************************************************************/ /**
 * @brief  DMA2D color key mode enable
 *
 * @param  dmaId: DMA2D id
 * @param  ch: DMA2D channel
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Color_Key_Enable(DMA2D_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get DMA2D register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA2D_COLOR_KEY_TYPE(keyType));

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_KEY_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, DMA2D_KEY_EN);
    BL_WR_REG(DMA2DChs, DMA2D_C0_KEY_EN, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA2D color key mode disable
 *
 * @param  dmaId: DMA2D id
 * @param  ch: DMA2D channel
 *
 * @return None
 *
*******************************************************************************/
void DMA2D_Color_Key_Disable(DMA2D_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get DMA2D register */
    uint32_t DMA2DChs = DMA2D_Get_Channel(dma2dAddr[dmaId], ch);

    tmpVal = BL_RD_REG(DMA2DChs, DMA2D_C0_KEY_EN);
    BL_WR_REG(DMA2DChs, DMA2D_C0_KEY_EN, BL_CLR_REG_BIT(tmpVal, DMA2D_KEY_EN));
}

/*@} end of group DMA2D_Public_Functions */

/*@} end of group DMA2D */

/*@} end of group BL808_Peripheral_Driver */
